; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v12 ?v10)
             (pred_12 ?v4 ?v7)
             (pred_5 ?v12 ?v7)
             (pred_6 ?v11 ?v12 )
	     (pred_7 ?v12)
             (pred_1 ?v2)
             (pred_8 ?v4)
             (pred_11 ?v7)
             (pred_3 ?v12)
             (pred_10 ?v4)
             (pred_9 ?v12)
             (pred_4 ))



(:action op_5
:parameters (?v6 ?v1 ?v13 ?v5)
:precondition (and (pred_1 ?v6) (pred_1 ?v1) (pred_8 ?v13) (pred_11 ?v5)
          (pred_2 ?v6 ?v1) (pred_12 ?v13 ?v5)
                   (pred_5 ?v1 ?v5) (pred_7 ?v6) 
                   (pred_3 ?v1) (pred_10 ?v13))
:effect (and  (pred_9 ?v1) (not (pred_3 ?v1))))


(:action op_1
:parameters (?v6 ?v3)
:precondition (and (pred_1 ?v6) (pred_1 ?v3)
               (pred_7 ?v6) (pred_2 ?v6 ?v3) (pred_9 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v6))))

(:action op_3
:parameters (?v6 ?v13)
:precondition (and (pred_1 ?v6) (pred_8 ?v13) 
                  (pred_7 ?v6) (pred_6 ?v13 ?v6) (pred_4 ))
:effect (and (pred_10 ?v13)
   (not (pred_6 ?v13 ?v6)) (not (pred_4 ))))


(:action op_4
:parameters (?v6 ?v8 ?v9)
:precondition (and (pred_1 ?v6) (pred_8 ?v8) (pred_8 ?v9)
                  (pred_7 ?v6) (pred_10 ?v9) (pred_6 ?v8 ?v6))
:effect (and (pred_10 ?v8) (pred_6 ?v9 ?v6)
        (not (pred_10 ?v9)) (not (pred_6 ?v8 ?v6))))

(:action op_2
:parameters (?v6 ?v13)
:precondition (and (pred_1 ?v6) (pred_8 ?v13) 
                  (pred_7 ?v6) (pred_10 ?v13))
:effect (and (pred_4 ) (pred_6 ?v13 ?v6) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_15 obj_09 obj_14 obj_06 obj_10 obj_30 obj_05 obj_13 obj_08 obj_18 obj_23 obj_19 obj_25 obj_16 obj_11 obj_12 obj_07 obj_28 obj_29 obj_04 obj_31 obj_02 obj_26 obj_21
    obj_01 obj_20 obj_22
    obj_03 obj_24 obj_27
    )

    (:init
       (pred_4)

       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_30)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_23)
       (pred_1 obj_19)
       (pred_1 obj_25)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_12)
       (pred_1 obj_07)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_04)
       (pred_1 obj_31)
       (pred_1 obj_02)
       (pred_1 obj_26)
       (pred_1 obj_21)
       (pred_11 obj_01)
       (pred_11 obj_20)
       (pred_11 obj_22)
       (pred_8 obj_03)
       (pred_8 obj_24)
       (pred_8 obj_27)

       (pred_2 obj_17 obj_10)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_15 obj_30)
       (pred_2 obj_15 obj_09)
       (pred_2 obj_15 obj_17)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_09 obj_14)
       (pred_2 obj_09 obj_15)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_14 obj_09)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_30)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_30 obj_23)
       (pred_2 obj_30 obj_05)
       (pred_2 obj_30 obj_15)
       (pred_2 obj_30 obj_10)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_30)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_18 obj_11)
       (pred_2 obj_18 obj_23)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_23 obj_12)
       (pred_2 obj_23 obj_19)
       (pred_2 obj_23 obj_30)
       (pred_2 obj_23 obj_18)
       (pred_2 obj_19 obj_07)
       (pred_2 obj_19 obj_25)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_19 obj_23)
       (pred_2 obj_25 obj_28)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_19)
       (pred_2 obj_16 obj_29)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_18)
       (pred_2 obj_12 obj_31)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_12 obj_23)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_28)
       (pred_2 obj_07 obj_19)
       (pred_2 obj_07 obj_12)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_28 obj_29)
       (pred_2 obj_28 obj_25)
       (pred_2 obj_28 obj_07)
       (pred_2 obj_29 obj_21)
       (pred_2 obj_29 obj_16)
       (pred_2 obj_29 obj_28)
       (pred_2 obj_04 obj_31)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_31 obj_02)
       (pred_2 obj_31 obj_12)
       (pred_2 obj_31 obj_04)
       (pred_2 obj_02 obj_26)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_31)
       (pred_2 obj_26 obj_21)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_02)
       (pred_2 obj_21 obj_29)
       (pred_2 obj_21 obj_26)
       (pred_3 obj_10)
       (pred_3 obj_11)
       (pred_3 obj_04)
       (pred_5  obj_10 obj_01)
       (pred_5  obj_11 obj_20)
       (pred_5  obj_04 obj_22)
       (pred_9 obj_17)
       (pred_9 obj_15)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_06)
       (pred_9 obj_30)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_25)
       (pred_9 obj_16)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_31)
       (pred_9 obj_02)
       (pred_9 obj_26)
       (pred_9 obj_21)

       (pred_12  obj_03 obj_01)
       (pred_12  obj_24 obj_20)
       (pred_12  obj_27 obj_22)
       (pred_6 obj_03 obj_15)
       (pred_6 obj_24 obj_17)
       (pred_6 obj_27 obj_29)
       (pred_7 obj_19)
    )

    (:goal (and
       (pred_6 obj_24 obj_07)
    ))
(:constraints
  (always (not (pred_7 obj_05)))
)
)

; plan
1. (op_1 obj_19 obj_23)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_23)
   goals met: 0 of 1
2. (op_1 obj_23 obj_30)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_30)
   goals met: 0 of 1
3. (op_1 obj_30 obj_15)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_17)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_24)
   deleted: (pred_6 obj_24 obj_17) (pred_4)
   added: (pred_10 obj_24)
   goals met: 0 of 1
6. (op_1 obj_17 obj_15)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_15)
   goals met: 0 of 1
7. (op_1 obj_15 obj_30)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_30)
   goals met: 0 of 1
8. (op_1 obj_30 obj_23)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_23)
   goals met: 0 of 1
9. (op_1 obj_23 obj_19)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_19)
   goals met: 0 of 1
10. (op_1 obj_19 obj_07)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_07)
   goals met: 0 of 1
11. (op_2 obj_07 obj_24)
   deleted: (pred_10 obj_24)
   added: (pred_4) (pred_6 obj_24 obj_07)
   goals met: 1 of 1
